{
    "浙江大学计算机学院吴朝晖教授讲授的《网格计算》课程是哪一年首次上传到浙江大学计算机学院的教学资源中？": "## Pages that may be related to the task\n\n### Page: http://www.cs.zju.edu.cn/csen/xwdt_38564/list.htm\nTitle: 更多>\nSummary: This webpage belongs to the College of Computer Science and Technology at Zhejiang University and serves as a news listing page. It provides a chronological list of news articles and updates related to the college, including academic events, research achievements, and institutional announcements. Users can browse the news titles and dates, and likely click on them to view full articles. Additional content may be available beyond the initial view, as pagination links are present at the bottom of the page.\n\n### Page: http://www.cs.zju.edu.cn/csen/30346\nTitle: None\nSummary: This webpage belongs to the College of Computer Science and Technology at Zhejiang University. It provides information about the college, including its overview, academic programs, organizational structure, and other related details. The page appears to be part of a larger website and serves as a navigation hub for exploring specific sections of the college's offerings. Additional content may be available below the fold, and scrolling is recommended to explore further.\n\n### Page: http://www.cs.zju.edu.cn/csen/27029/list.htm\nTitle: 学术讲座\nSummary: This webpage, titled '学术讲座' (Academic Lectures), is part of the College of Computer Science and Technology at Zhejiang University. It provides a list of academic lectures, including their titles, speakers, and dates. The page is designed to inform users about past and upcoming academic events. Additional content may be available beyond the initial view, and scrolling is recommended to explore the full list of lectures.\n\n### Page: http://www.cs.zju.edu.cn/csen/xkjs\nTitle: None\nSummary: This webpage belongs to the College of Computer Science and Technology at Zhejiang University. It provides information about academic developments, announcements, and resources related to the institution. The page prominently features a list of academic notices and updates, along with a navigation menu for exploring related topics. Additional content may be available below the fold, and scrolling is recommended to view all information.\n\n### Page: http://www.cs.zju.edu.cn/csen\nTitle: None\nSummary: This webpage belongs to the College of Computer Science and Technology at Zhejiang University. It serves as an informational hub, providing updates on news, events, academic activities, and announcements related to the college. The page features a prominent banner, recent news highlights, academic lecture schedules, and contact information. Additional content is likely available below the fold, and scrolling is recommended to explore further details.\n\n**Hints**: you can use the links to navigate to the task-releated page by 'go_to_url' action.\n",
    "浙江大学计算机学院设计管理课程的教学大纲首次上传是在哪个年份的几月份？": "## Pages that may be related to the task\n\n### Page: http://www.cs.zju.edu.cn/csen/xwdt_38564/list.htm\nTitle: 更多>\nSummary: This webpage belongs to the College of Computer Science and Technology at Zhejiang University and serves as a news listing page. It provides a chronological list of news articles and updates related to the college, including academic events, research achievements, and institutional announcements. Users can browse the news titles and dates, and likely click on them to view full articles. Additional content may be available beyond the initial view, as pagination links are present at the bottom of the page.\n\n### Page: http://www.cs.zju.edu.cn/csen/xkjs\nTitle: None\nSummary: This webpage belongs to the College of Computer Science and Technology at Zhejiang University. It provides information about academic developments, announcements, and resources related to the institution. The page prominently features a list of academic notices and updates, along with a navigation menu for exploring related topics. Additional content may be available below the fold, and scrolling is recommended to view all information.\n\n### Page: http://www.cs.zju.edu.cn/csen/27029/list.htm\nTitle: 学术讲座\nSummary: This webpage, titled '学术讲座' (Academic Lectures), is part of the College of Computer Science and Technology at Zhejiang University. It provides a list of academic lectures, including their titles, speakers, and dates. The page is designed to inform users about past and upcoming academic events. Additional content may be available beyond the initial view, and scrolling is recommended to explore the full list of lectures.\n\n### Page: http://www.cs.zju.edu.cn/csen/26916/list.htm\nTitle: 学院大事记\nSummary: This webpage belongs to the College of Computer Science and Technology at Zhejiang University and focuses on the '学院大事记' (College Major Events) section. It provides navigation options to explore the college's overview, leadership, organizational structure, and major events. The page features a clean layout with a header, navigation menu, and a content area. Additional content may be available below the fold, and scrolling is suggested to explore further.\n\n### Page: http://www.cs.zju.edu.cn/csen\nTitle: None\nSummary: This webpage belongs to the College of Computer Science and Technology at Zhejiang University. It serves as an informational hub, providing updates on news, events, academic activities, and announcements related to the college. The page features a prominent banner, recent news highlights, academic lecture schedules, and contact information. Additional content is likely available below the fold, and scrolling is recommended to explore further details.\n\n**Hints**: you can use the links to navigate to the task-releated page by 'go_to_url' action.\n"
}